Before you turn this problem in, make sure everything runs as expected. First, **restart the kernel** (in the menu bar, select Kernel$\rightarrow$Restart) and then **run all cells** (in the menu bar, select Cell$\rightarrow$Run All).

Make sure that in addition to the code, you provide written answers for all questions of the assignment. You can add a new cell and set the type as "Markdown" so you can include your answers in this notebook.

Below, please fill in your name:

In [1]:
NAME = "Farnaz Ghodousipour"

## Assignment 3 - Data Analysis using Pandas
**(15 points total)**

For this assignment, we will analyze data on the passengers aboard the Titanic.

Use the .csv file provided. The definition of all variables can be found in the following Kaggle page, in the Data Dictionary section. https://www.kaggle.com/c/titanic/data

Read the data from the file into pandas DataFrame. Analyze the data to answer the following question: 

**Which categories of passengers were most likely to survive the Titanic disaster?**

**Part 1.**  _(15 points)_
* The answer to the main question - Which categories of passengers were most likely to survive the Titanic disaster? 
* Which variables did you use to determine likelihood of survival? What was your hypothesis and how did it evolve as you began analyzing the data?

**Part 2.**  _(15 points)_
* How did you approach your analysis using Python? Which functionalities did you use? Why?

I grouped passengers to survived an unsurvived and then sex, age group, parch and pclass. I have explaned my observations step by step.

I have mainly used 
-groupby since it is the best way to separate for example survived from unfurvived or famale from male. 
-count to see how many of passengers are in that specific group
-

In [83]:
import pandas as pd

In [84]:
df= pd.read_csv(r"\Users\farna\Documents\Data Science\UofT\assignments\3\TitanicData.csv")

In [85]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [86]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,714.000000,714.000000,714.000000,714.000000,714.000000,714.000000,714.000000
mean,448.582633,0.406162,2.236695,29.699118,0.512605,0.431373,34.694514
std,259.119524,0.491460,0.838250,14.526497,0.929783,0.853289,52.918930
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,222.250000,0.000000,1.000000,20.125000,0.000000,0.000000,8.050000
50%,445.000000,0.000000,2.000000,28.000000,0.000000,0.000000,15.741700
75%,677.750000,1.000000,3.000000,38.000000,1.000000,1.000000,33.375000
max,891.000000,1.000000,3.000000,80.000000,5.000000,6.000000,512.329200

In [87]:
df_grouped=df.groupby('Survived')

In [88]:
df_survive=df_grouped.get_group(1)

In [89]:
df.groupby('Survived').count()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,,
0,424,424,424,424,424,424,424,424,424,60,424
1,290,290,290,290,290,290,290,290,290,125,288

As we can see in total from 714 passengers 424 had not survived and 290 had survived.

I am expecting to find more female being survived than men because most men let the women and kids to go first. To find female from survived:

In [90]:
df_sex1 = df_survive.groupby('Sex')

In [91]:
df_female1 =df_sex1.get_group('female')
df_female1.count()

PassengerId    197
Survived       197
Pclass         197
Name           197
Sex            197
Age            197
SibSp          197
Parch          197
Ticket         197
Fare           197
Cabin           84
Embarked       195
dtype: int64

197 out of 290 survivals were female. So most of the survived passengers were female.

In [92]:
df_unsurvive=df_grouped.get_group(0)

To find female from unsurvived:

In [93]:
df_sex2 = df_unsurvive.groupby('Sex')

In [94]:
df_female2 =df_sex2.get_group('female')
df_female2.count()

PassengerId    64
Survived       64
Pclass         64
Name           64
Sex            64
Age            64
SibSp          64
Parch          64
Ticket         64
Fare           64
Cabin           6
Embarked       64
dtype: int64

64 out of 424 were female. So most of the unsurvived passengers were male.

In [95]:
df.groupby('Survived')['Age'].aggregate(['mean','median','max'])

               mean  median   max
Survived
0         30.626179    28.0  74.0
1         28.343690    28.0  80.0

Overal the the chance of survival gets smaller when the age goes above 28.

In [96]:
df.groupby('Survived')['Parch'].aggregate(['mean','median','max'])

              mean  median  max
Survived
0         0.365566       0    6
1         0.527586       0    5

In [97]:
df_parch1 = df_survive.groupby('Parch')
df_parch1.get_group(0).count()

PassengerId    186
Survived       186
Pclass         186
Name           186
Sex            186
Age            186
SibSp          186
Parch          186
Ticket         186
Fare           186
Cabin           82
Embarked       184
dtype: int64

In [98]:
df_parch2 = df_unsurvive.groupby('Parch')
df_parch2.get_group(0).count()

PassengerId    335
Survived       335
Pclass         335
Name           335
Sex            335
Age            335
SibSp          335
Parch          335
Ticket         335
Fare           335
Cabin           42
Embarked       335
dtype: int64

looking at data I can see smaller families were more likely to survive.

In [99]:
df_parch1 = df_survive.groupby('Parch')
df_parch1.get_group(1).count()

PassengerId    61
Survived       61
Pclass         61
Name           61
Sex            61
Age            61
SibSp          61
Parch          61
Ticket         61
Fare           61
Cabin          26
Embarked       61
dtype: int64

In [100]:
df_parch2 = df_unsurvive.groupby('Parch')
df_parch2.get_group(1).count()

PassengerId    49
Survived       49
Pclass         49
Name           49
Sex            49
Age            49
SibSp          49
Parch          49
Ticket         49
Fare           49
Cabin          11
Embarked       49
dtype: int64

In [101]:
df_parch1 = df_survive.groupby('Parch')
df_parch1.get_group(5).count()

PassengerId    1
Survived       1
Pclass         1
Name           1
Sex            1
Age            1
SibSp          1
Parch          1
Ticket         1
Fare           1
Cabin          0
Embarked       1
dtype: int64

In [102]:
df_parch2 = df_unsurvive.groupby('Parch')
df_parch2.get_group(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
482,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,39.0,1,5,347082,31.2750,NaN,S
505,639,0,3,"Panula, Mrs. Juha (Maria Emilia Ojala)",female,41.0,0,5,3101295,39.6875,NaN,S
709,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [103]:
 df.groupby('Survived')['Parch'].aggregate(['mean','median','max'])

              mean  median  max
Survived
0         0.365566       0    6
1         0.527586       0    5

As we can conclude frome df.describe() above, since few peaple brought family, and I am assuming they had spent less time to survive children then smaller families(0) has more chance of survival. But as I can see the family of(1) have less chance of survival. in that case I don't really see relation between parch and survival for the parch>0.

In [104]:
df_female_old = df_survive[(df_survive['Sex']=='female') & (df_survive['Age']>=50)]

In [105]:
df_female_old.count()

PassengerId    20
Survived       20
Pclass         20
Name           20
Sex            20
Age            20
SibSp          20
Parch          20
Ticket         20
Fare           20
Cabin          13
Embarked       19
dtype: int64

In [106]:
df_female_young = df_survive[(df_survive['Sex']=='female') & (df_survive['Age']<=50)]

In [107]:
df_female_young.count()

PassengerId    181
Survived       181
Pclass         181
Name           181
Sex            181
Age            181
SibSp          181
Parch          181
Ticket         181
Fare           181
Cabin           72
Embarked       180
dtype: int64

We can conclude the younger women (younger that 50),(181) had bigger chance of survival than older(older that 50),(20).

In [108]:
df_male_old = df_survive[(df_survive['Sex']=='male') & (df_survive['Age']>=50)]
df_male_old.count()

PassengerId    7
Survived       7
Pclass         7
Name           7
Sex            7
Age            7
SibSp          7
Parch          7
Ticket         7
Fare           7
Cabin          5
Embarked       7
dtype: int64

In [109]:
df_male_young = df_survive[(df_survive['Sex']=='male') & (df_survive['Age']<=50)]
df_male_young.count()

PassengerId    87
Survived       87
Pclass         87
Name           87
Sex            87
Age            87
SibSp          87
Parch          87
Ticket         87
Fare           87
Cabin          36
Embarked       87
dtype: int64

We can conclude the younger men (87), had bigger chance of survival than older(7).

In [110]:
df_class = df_survive.groupby('Pclass')
df_class.get_group(1).count()

PassengerId    122
Survived       122
Pclass         122
Name           122
Sex            122
Age            122
SibSp          122
Parch          122
Ticket         122
Fare           122
Cabin          108
Embarked       120
dtype: int64

In [111]:
df_class = df_survive.groupby('Pclass')
df_class.get_group(2).count()

PassengerId    83
Survived       83
Pclass         83
Name           83
Sex            83
Age            83
SibSp          83
Parch          83
Ticket         83
Fare           83
Cabin          12
Embarked       83
dtype: int64

In [112]:
df_class = df_survive.groupby('Pclass')
df_class.get_group(3).count()

PassengerId    85
Survived       85
Pclass         85
Name           85
Sex            85
Age            85
SibSp          85
Parch          85
Ticket         85
Fare           85
Cabin           5
Embarked       85
dtype: int64

As expected the passengers of the first class probably had more access to the boats so had more chance of survival but between 2nd and 3rd class there was almost no difference.